let cron = require('node-cron');


const poster = require('./index');

/*-------------------------------------------------------------------*/
/*     |                       
/*     |                      Сообщения в консольку      
/*     V                        
/*-------------------------------------------------------------------*/
console.log(`Постеры успешно запущены!`)

/*-------------------------------------------------------------------*/
/*     |                       
/*     |                      Интервалы      
/*     V                        
/*-------------------------------------------------------------------*/
setTimeout(() => {
    console.log('ВЫЗВАЛОСЬ');
    poster.publish('lb');
}, 10000);

// cron.schedule(`0 *  *  *  *`, () => {
// poster.publish('lb');
// poster.publish('lt');
// poster.publish('fb');
// });