const checker = require('./functions');

/*-------------------------------------------------------------------*/
/*     |                       
/*     |                      Сообщения в консольку      
/*     V                        
/*-------------------------------------------------------------------*/
console.log(`Проверяторы доната успешно запущены!`)

/*-------------------------------------------------------------------*/
/*     |                       
/*     |                      Интервалы      
/*     V                        
/*-------------------------------------------------------------------*/

cron.schedule(`10 * * * *`, () => {
    checker.checkDonate('lb');
    checker.checkDonate('lt');
    checker.checkDonate('fb');
});