const checker = require('./functions');
const minutes = 10; // через сколько минут проводить проверку


/*-------------------------------------------------------------------*/
/*     |                       
/*     |                      Сообщения в консольку      
/*     V                        
/*-------------------------------------------------------------------*/
console.log(`Интервалы успешно запущены. Будем проверять донат раз в ${minutes} минут.`)
    /*-------------------------------------------------------------------*/
    /*     |                       
    /*     |                      Интервалы      
    /*     V                        
    /*-------------------------------------------------------------------*/
const mc = 60000;
const interval = minutes * mc;

setInterval(() => {
    checker.checkDonate('lb');
}, interval);
setInterval(() => {
    checker.checkDonate('lt');
}, interval);
setInterval(() => {
    checker.checkDonate('fb');
}, interval);